org/_posts/2014-01-17-api-authentication-with-liberator-and-friend.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: API Authentication with Liberator and Friend
---

<p class="meta">Jan 17 2014 - Boulder</p>
#+END_HTML

* Liberator and Friend

I've just finished rewriting a number of [[https://paddleguru.com][PaddleGuru]]'s internal APIs using two great open-source libraries; [[http://clojure-liberator.github.io/liberator/][Liberator]] and [[https://github.com/cemerick/friend][Friend]]. Liberator is a library for writing RESTful resources in Clojure. Friend is an authorization and authentication library written by the prolific Chas Emerick, Dominator, Esquire. You've certainly seen his stuff around if you've played with Clojure(Script) in any level of detail.

Authentication and authorization are both really important in RESTful APIs. These libraries are made for each other, I thought to myself. I'll just use them together and life will be wonderful. Right?

Well, not so much. Friend and Liberator both have opinionated approaches authentication. Integrating the two was trickier than I imagined, and required a bit of code massage.

In this post, I'll give a short overview of Liberator and a not-so-shrot overview of Friend. (Friend's more confusing, and needs a longer treatment.) I'll discuss how each of these libraries deals with authorization and authentication, and walk through an example project I built that demonstrates how PaddleGuru uses Friend and Liberator in concert to define RESTful API endpoints with really nice, consistent authorization and authentication handling.

The code for the example project is up on [[https://github.com/sritchie/liberator-friend][GitHub]].

** Liberator

Liberator lets you define a RESTful resource as a graph of decision points and responses (represented as key-value pairs in Clojure). It handles content negotiation, resource caching, all of the tough stuff that you end up doing as nested function calls without a library like Liberator.

From the [[http://clojure-liberator.github.io/liberator/][project site]]:

#+BEGIN_QUOTE
Liberator is a Clojure library that helps you expose your data as resources while automatically complying with all the relevant requirements of the HTTP specification (RFC-2616). Your resources will automatically gain useful HTTP features, such as caching and content negotiation. Liberator was inspired by Erlang’s Webmachine. By following the constraints and requirements in RFC-2616, liberator will enable you to create application according to a REST architecture.
#+END_QUOTE

Here's a simple resource that handles only HTML responses, and returns =406 Not Acceptable= if the user requests some other content type:

#+BEGIN_SRC clojure
  (defresource hello-resource
    :available-media-types ["text/html"]
    :handle-ok "<html>Hello, Internet.</html>")
#+END_SRC

Because a resource is a function of a request, you can use resources with Compojure like this:

#+BEGIN_SRC clojure
(ANY "/foo" [] hello-resource)
#+END_SRC

Check out the [[http://clojure-liberator.github.io/liberator/][project page]] for more tutorials and documentation.

** Friend

Friend provides Ring middleware that handles authentication and authorization for your app. ("Authentication" is whether or not the system knows who you are; authorization is whether or not you're allowed in to a particular resource, one the system identifies you.)

The middleware looks like this:

#+BEGIN_SRC clojure
(ns liberator-friend.middleware.auth
  (:require [cemerick.friend :as friend]
            (cemerick.friend [workflows :as workflows]
                             [credentials :as creds])))

(defn friend-middleware
  "Returns a middleware that enables authentication via Friend."
  [handler users]
  (let [friend-m {:credential-fn (partial creds/bcrypt-credential-fn users)
                  :workflows
                  [(workflows/http-basic :realm "/")
                   (workflows/interactive-form)]}]
    (-> handler
        (friend/authenticate friend-m))))
#+END_SRC

This middleware sits over top of all of your resources and routing layer (typically handled with a library like [[https://github.com/weavejester/compojure][Compojure]]), and provides all of the plumbing necessary for authorization and authentication.

(Okay, this is where it gets confusing. For me, anyway. There's a lot of indirection to keep track of in the API. Follow me as best you can, and supplement with Friend's [[https://github.com/cemerick/friend][extensive documentation]].)

