_posts/2014-01-17-api-authentication-with-liberator-and-friend.html
---
layout: post
title: API Authentication with Liberator and Friend
---

<p class="meta">Jan 17 2014 - Boulder</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">API Authentication with Liberator and Friend</h2>
<div class="outline-text-2" id="text-1">
<p>
I've just finished rewriting a number of <a href="https://paddleguru.com">PaddleGuru</a>'s internal APIs using two great open-source libraries; <a href="http://clojure-liberator.github.io/liberator/">Liberator</a> and <a href="https://github.com/cemerick/friend">Friend</a>. Liberator is a library for writing RESTful resources in Clojure. Friend is an authorization and authentication library written by the prolific Chas Emerick, Dominator, Esquire. You've certainly seen his stuff around if you've played with Clojure(Script) in any level of detail.
</p>

<p>
Authentication and authorization are both really important in RESTful APIs. These libraries are made for each other, I thought to myself. I'll just use them together and life will be wonderful. Right?
</p>

<p>
Well, not so much. Friend and Liberator both have opinionated approaches authentication. Integrating the two was trickier than I imagined, and required a bit of code massage.
</p>

<p>
In this post, I'll give a short overview of Liberator and a not-so-short overview of Friend. (Friend's more confusing, and needs a longer treatment.) I'll discuss how each of these libraries deals with authorization and authentication, and walk through an example project I built that demonstrates how PaddleGuru uses Friend and Liberator in concert to define RESTful API endpoints with really nice, consistent authorization and authentication handling.
</p>

<p>
The code for the example project is up on <a href="https://github.com/paddleguru/liberator-friend">GitHub</a>.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Liberator</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Liberator lets you define a RESTful resource as a graph of decision points and responses (represented as key-value pairs in Clojure). It handles content negotiation, resource caching, all of the tough stuff that you end up doing as nested function calls without a library like Liberator.
</p>

<p>
From the <a href="http://clojure-liberator.github.io/liberator/">project site</a>:
</p>

<blockquote>
<p>
Liberator is a Clojure library that helps you expose your data as resources while automatically complying with all the relevant requirements of the HTTP specification (RFC-2616). Your resources will automatically gain useful HTTP features, such as caching and content negotiation. Liberator was inspired by Erlang’s Webmachine. By following the constraints and requirements in RFC-2616, liberator will enable you to create application according to a REST architecture.
</p>
</blockquote>

<p>
Here's a simple resource that handles only HTML responses, and returns <code>406 Not Acceptable</code> if the user requests some other content type:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defresource</span> <span style="color: #0000ff;">hello-resource</span>
  <span style="color: #008b8b;">:available-media-types</span> [<span style="color: #8b2252;">"text/html"</span>]
  <span style="color: #008b8b;">:handle-ok</span> <span style="color: #8b2252;">"&lt;html&gt;Hello, Internet.&lt;/html&gt;"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Because a resource is a function of a request, you can use resources with Compojure like this:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">ANY</span> <span style="color: #8b2252;">"/foo"</span> [] hello-resource<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Check out the <a href="http://clojure-liberator.github.io/liberator/">project page</a> for more tutorials and documentation.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Friend</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Friend provides Ring middleware that handles authentication and authorization for your app. ("Authentication" is whether or not the system knows who you are; authorization is whether or not you're allowed in to a particular resource, one the system identifies you.)
</p>

<p>
The middleware looks like this:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">ns</span> liberator-friend.middleware.auth
  <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:require</span> [cemerick.friend <span style="color: #008b8b;">:as</span> friend]
            <span style="color: #8c8c8c;">(</span>cemerick.friend [workflows <span style="color: #008b8b;">:as</span> workflows]
                             [credentials <span style="color: #008b8b;">:as</span> creds]<span style="color: #8c8c8c;">)))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">friend-middleware</span>
  <span style="color: #8b2252;">"Returns a middleware that enables authentication via Friend."</span>
  [handler users]
  <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">let</span> [friend-m {<span style="color: #008b8b;">:credential-fn</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">partial</span> creds/bcrypt-credential-fn users<span style="color: #8c8c8c;">)</span>
                  <span style="color: #008b8b;">:workflows</span>
                  [<span style="color: #8c8c8c;">(</span>workflows/http-basic <span style="color: #008b8b;">:realm</span> <span style="color: #8b2252;">"/"</span><span style="color: #8c8c8c;">)</span>
                   <span style="color: #8c8c8c;">(</span>workflows/interactive-form<span style="color: #8c8c8c;">)</span>]}]
    <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">-&gt;</span> handler
        <span style="color: #8c8c8c;">(</span>friend/authenticate friend-m<span style="color: #8c8c8c;">))))</span>
</pre>
</div>

<p>
This middleware sits over top of all of your resources and routing layer (typically handled with a library like <a href="https://github.com/weavejester/compojure">Compojure</a>), and provides all of the plumbing necessary for authorization and authentication.
</p>

<p>
(Okay, this is where it gets confusing. For me, anyway. There's a lot of indirection to keep track of in the API. Follow me as best you can, and supplement with Friend's <a href="https://github.com/cemerick/friend">extensive documentation</a>.)
</p>
</div>
