org/_posts/2014-01-17-api-authentication-with-liberator-and-friend.org
*** Authentication

Friend's "workflows" provide pluggable authentication for your app.

Friend considers a request to be authenticated if the incoming request's session has a certain special key:

#+BEGIN_SRC clojure
{:session {::cemerick.friend/identity <user's identity!>}}
#+END_SRC

(That's a [[https://kotka.de/blog/2010/05/Did_you_know_III.html][namespace-qualified keyword]], by the way.)

Friend's middleware examines every incoming request for this key. If the key is present, Friend passes the request on, no problem. (If you're using a session store, this will prevent your app from having to run through the login workflows on every request).

If =::cemerick.friend/identity= is missing from the session, Friend's middleware attempts to authenticate the session using its workflows. The middleware passes the request into each workflow in turn until one kicks out a return value, or all have returned =nil=. Only then will the middleware pass your request on.

Let's talk about the supported return values. Workflows can return one of three things:

- *nil*: =nil= means that the workflow has no nothing to say about the supplied request. Friend will send the request to the next workflow in the list, if one exists. If no workflows are left, Friend calls your handler.
- *Friend Auth*: This is ANY Clojure map with a type of =::cemerick.friend/auth=. The default workflows try to authenticate a user using the =:credential-fn= you supplied to the middleware (see my above example). If =:credential-fn= returns a map, the default workflows interpret it as a user record, associate the =::cemerick.friend/auth= type metadata, merge the identity into the request under ={:session {::cemerick.friend/identity <returned auth map>}}= and call your hander with the updated, authenticated request.
- *Anything else*: Any other response is treated as a ring response, and passed back immediately. Your handler is never called.

Let's look at an example workflow to see how it handles these three cases. In my snippet above I included Friend's =http-basic= workflow:

#+BEGIN_SRC clojure
(require 'cemerick.friend.workflows)
(workflows/http-basic :realm "/")
#+END_SRC

([[https://github.com/cemerick/friend/blob/master/src/cemerick/friend/workflows.clj#L35][Here's the code]] if you want to follow along.)

When this workflow sees a request, it first checks the request for an =authorization= header. If that header's missing, it returns =nil=, and Friend proceeds to the next workflow, or lets the request through.

If the =authorization= header IS present, the workflow extracts the supplied username and password and passes them in to =:credential-fn=.

If this check succeeds (ie, returns something non-nil), the workflow returns the required =::cemerick.friend/identity= key described above. If it fails, the workflow returns [[https://github.com/cemerick/friend/blob/master/src/cemerick/friend/workflows.clj#L58][a failing ring response]]:

#+BEGIN_SRC clojure
  {:status 400
   :body "Malformed Authorization header for HTTP Basic authentication."}
#+END_SRC

You can use these three response types to implement some pretty interesting authentication workflows.

You can do a lot in this framework. [[https://github.com/ddellacosta][Ddellacosta]]'s [[https://github.com/ddellacosta/friend-oauth2][Friend OAuth2 workflow]] intercepts the initial OAuth request and uses the "failure" return to send out an OAuth2 redirect to the configured provider. When the provider redirects back to the app, the OAuth2 workflow again intercepts the command, does token negotation, then either succeeds or fails the response. Two intercepts! There's a lot going on there.

*** Authorization

Okay, phew. That covers authentication. Now we need to talk about authorization, or protecting your resources.

Resources typically handle authorization with some function of the =::friend/identity= that the middleware added to the session. If the identity is missing (IE, the request isn't authenticated) or the identity doesn't have the required permissions, the resource can throw an exception with [[https://github.com/cemerick/friend/blob/master/src/cemerick/friend.clj#L256][cemerick.friend/throw-unauthorized]] with the identity that didn't pass the check. (This might be nil, of course.) This function throws an exception with some special metadata.

Friend's middleware is wrapping the entire app, and catches exceptions with this special metadata as they bubble up. Once this happens, Friend takes responsibility for the response with one of two actions:

- If Friend sees that the user is authenticated, it calls =:unauthorized-handler=. (You supply this option when you create the middleware. This is where you'd return some sexy, custom page, or redirect to the home page with a flash yelling "You're not authorized!"). You can include custom info in the thrown exception to make that flash all custom and sexy.
- If the request is NOT authenticated (no =::friend/identity= in the session), Friend calls the =:unauthenticated-handler=. By default, this stores the URI the request was originally trying to access in the session map and redirects the user to your login page.

Now, in the latter, unauthenticated case, Friend typically redirects to a route that's being watched by one of the workflows. Friend's supplied =interactive-form= workflow does this; it redirects to a URI like "/login", then intercepts POST requests to "/login" and tries to pull out credentials and authenticate.

Once you're authenticated (and this is a new thing I didn't mention above), if the session has any record of the URI you were trying to access when the app threw the =unauthorized!= exception, Friend will BREAK from the pattern I mentioned above and instead redirect to that stored URI. This gives the resource another chance to check your (now populated) credentials.

If you make it through, great. If the resource throws an exception again, Friend will catch it again, but this time take the first branch and call =:unauthorized-handler=.

I find all that throwing and catching to be extremely confusing. I'm not really sure how to clean it up, but please, please let me know if you have ideas after ingesting all of this.

