_posts/2014-01-17-api-authentication-with-liberator-and-friend.html

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Authentication</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Friend's "workflows" provide pluggable authentication for your app.
</p>

<p>
Friend considers a request to be authenticated if the incoming request's session has a certain special key:
</p>

<div class="org-src-container">

<pre class="src src-clojure">{<span style="color: #008b8b;">:session</span> {<span style="color: #008b8b;">::cemerick.friend/identity</span> &lt;user's identity!&gt;}}
</pre>
</div>

<p>
(That's a <a href="https://kotka.de/blog/2010/05/Did_you_know_III.html">namespace-qualified keyword</a>, by the way.)
</p>

<p>
Friend's middleware examines every incoming request for this key. If the key is present, Friend passes the request on, no problem. (If you're using a session store, this will prevent your app from having to run through the login workflows on every request).
</p>

<p>
If <code>::cemerick.friend/identity</code> is missing from the session, Friend's middleware attempts to authenticate the session using its workflows. The middleware passes the request into each workflow in turn until one kicks out a return value, or all have returned <code>nil</code>. Only then will the middleware pass your request on.
</p>

<p>
Let's talk about the supported return values. Workflows can return one of three things:
</p>

<ul class="org-ul">
<li><b>nil</b>: <code>nil</code> means that the workflow has no nothing to say about the supplied request. Friend will send the request to the next workflow in the list, if one exists. If no workflows are left, Friend calls your handler.
</li>
<li><b>Friend Auth</b>: This is ANY Clojure map with a type of <code>::cemerick.friend/auth</code>. The default workflows try to authenticate a user using the <code>:credential-fn</code> you supplied to the middleware (see my above example). If <code>:credential-fn</code> returns a map, the default workflows interpret it as a user record, associate the <code>::cemerick.friend/auth</code> type metadata, merge the identity into the request under <code>{:session {::cemerick.friend/identity &lt;returned auth map&gt;}}</code> and call your hander with the updated, authenticated request.
</li>
<li><b>Anything else</b>: Any other response is treated as a ring response, and passed back immediately. Your handler is never called.
</li>
</ul>

<p>
Let's look at an example workflow to see how it handles these three cases. In my snippet above I included Friend's <code>http-basic</code> workflow:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">require</span> 'cemerick.friend.workflows<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>workflows/http-basic <span style="color: #008b8b;">:realm</span> <span style="color: #8b2252;">"/"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
(<a href="https://github.com/cemerick/friend/blob/master/src/cemerick/friend/workflows.clj#L35">Here's the code</a> if you want to follow along.)
</p>

<p>
When this workflow sees a request, it first checks the request for an <code>authorization</code> header. If that header's missing, it returns <code>nil</code>, and Friend proceeds to the next workflow, or lets the request through.
</p>

<p>
If the <code>authorization</code> header IS present, the workflow extracts the supplied username and password and passes them in to <code>:credential-fn</code>.
</p>

<p>
If this check succeeds (ie, returns something non-nil), the workflow returns the required <code>::cemerick.friend/identity</code> key described above. If it fails, the workflow returns <a href="https://github.com/cemerick/friend/blob/master/src/cemerick/friend/workflows.clj#L58">a failing ring response</a>:
</p>

<div class="org-src-container">

<pre class="src src-clojure">{<span style="color: #008b8b;">:status</span> 400
 <span style="color: #008b8b;">:body</span> <span style="color: #8b2252;">"Malformed Authorization header for HTTP Basic authentication."</span>}
</pre>
</div>

<p>
You can use these three response types to implement some pretty interesting authentication workflows.
</p>

<p>
You can do a lot in this framework. <a href="https://github.com/ddellacosta">Ddellacosta</a>'s <a href="https://github.com/ddellacosta/friend-oauth2">Friend OAuth2 workflow</a> intercepts the initial OAuth request and uses the "failure" return to send out an OAuth2 redirect to the configured provider. When the provider redirects back to the app, the OAuth2 workflow again intercepts the command, does token negotation, then either succeeds or fails the response. Two intercepts! There's a lot going on there.
</p>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">Authorization</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Okay, phew. That covers authentication. Now we need to talk about authorization, or protecting your resources.
</p>

<p>
Resources typically handle authorization with some function of the <code>::friend/identity</code> that the middleware added to the session. If the identity is missing (IE, the request isn't authenticated) or the identity doesn't have the required permissions, the resource can throw an exception with <a href="https://github.com/cemerick/friend/blob/master/src/cemerick/friend.clj#L256">cemerick.friend/throw-unauthorized</a> with the identity that didn't pass the check. (This might be nil, of course.) This function throws an exception with some special metadata.
</p>

<p>
Friend's middleware is wrapping the entire app, and catches exceptions with this special metadata as they bubble up. Once this happens, Friend takes responsibility for the response with one of two actions:
</p>

<ul class="org-ul">
<li>If Friend sees that the user is authenticated, it calls <code>:unauthorized-handler</code>. (You supply this option when you create the middleware. This is where you'd return some sexy, custom page, or redirect to the home page with a flash yelling "You're not authorized!"). You can include custom info in the thrown exception to make that flash all custom and sexy.
</li>
<li>If the request is NOT authenticated (no <code>::friend/identity</code> in the session), Friend calls the <code>:unauthenticated-handler</code>. By default, this stores the URI the request was originally trying to access in the session map and redirects the user to your login page.
</li>
</ul>

<p>
Now, in the latter, unauthenticated case, Friend typically redirects to a route that's being watched by one of the workflows. Friend's supplied <code>interactive-form</code> workflow does this; it redirects to a URI like "/login", then intercepts POST requests to "/login" and tries to pull out credentials and authenticate.
</p>

<p>
Once you're authenticated (and this is a new thing I didn't mention above), if the session has any record of the URI you were trying to access when the app threw the <code>unauthorized!</code> exception, Friend will BREAK from the pattern I mentioned above and instead redirect to that stored URI. This gives the resource another chance to check your (now populated) credentials.
</p>

<p>
If you make it through, great. If the resource throws an exception again, Friend will catch it again, but this time take the first branch and call <code>:unauthorized-handler</code>.
</p>

<p>
I find all that throwing and catching to be extremely confusing. I'm not really sure how to clean it up, but please, please let me know if you have ideas after ingesting all of this.
</p>
</div>
</div>
</div>
