org/_posts/2014-01-17-api-authentication-with-liberator-and-friend.org
** Combining Friend and Liberator

Liberator has a decision point to deal with authorization and authentication: =:authorized?=. You provide a predicate for the =:authorized?= key in your resource definition, and Liberator will either call its =:handle-unauthorized= handler (on false) or proceed down the decision tree (on true).

After figuring out Friend and absorbing all of the intricate subtleties described above, it became clear to me that a single predicate was NOT enough for really good auth. Rather than rolling my own session management, redirect handlers, etc, I had to figure out how to use the two libraries together.

My main blocker here was that Liberator didn't allow resources to inherit key-value pairs from other resources. The resources are effectively maps, and you should be able to define a base map of decision points and then merge them together.

So I wrote [[https://github.com/clojure-liberator/liberator][a pull request]] that extends Liberator's resources to accept a =:base= key. The =:base= key takes a map of liberator decision points and creates your resource by merging the other kv pairs into these defaults.

This pull req allows you to define a base resource like this:

#+BEGIN_SRC clojure
  (def base-resource
    "Base for all resources.

     Due to the way liberator's resources merge, these base definitions
     define a bunch of content types, even if the resources that inherit
     from them don't. The defaults are here to provide reasonable text
     error messages, instead of returning big slugs of html."
    (let [not-found (comp rep/ring-response
                          (route/not-found "Route not found!"))
          base {"text/html" not-found}]
      {:handle-not-acceptable
       (->> {"application/json" {:success false
                                 :message "No acceptable resource available"}
             "text/plain" "No acceptable resource available."}
            (with-default "text/plain")
            (media-typed base))

       :handle-not-found
       (->> {"application/json" {:success false
                                 :message "Resource not found."}
             "text/plain" "Resource not found."}
            (with-default "text/plain")
            (media-typed base))}))
#+END_SRC

And then write other resources that extend the base like so:

#+BEGIN_SRC clojure
  (defresource hello-resource
    :base base-resource
    :allowed-methods [:get]
    :available-media-types ["text/plain"]
    :handle-ok "Welcome to the resource!")
#+END_SRC

This tiny resource now shares the =:handle-not-acceptable= and =:handle-not-found= behavior from the base. If I hit the resource and ask for JSON, for example, I'll get a "No acceptable resource available." message in plain-text. (There's more work here to make this perfect, but hey, it's a start.)

Check out my customer version of =defresource= in the post's [[https://github.com/sritchie/liberator-friend/blob/master/src/liberator_friend/resources.clj#L67][example project]]. That namespace also contains =base-resource= and all the helper functions.

