_posts/2014-01-17-api-authentication-with-liberator-and-friend.html
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Combining Friend and Liberator</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Liberator has a decision point to deal with authorization and authentication: <code>:authorized?</code>. You provide a predicate for the <code>:authorized?</code> key in your resource definition, and Liberator will either call its <code>:handle-unauthorized</code> handler (on false) or proceed down the decision tree (on true).
</p>

<p>
After figuring out Friend and absorbing all of the intricate subtleties described above, it became clear to me that a single predicate was NOT enough for really good auth. Rather than rolling my own session management, redirect handlers, etc, I had to figure out how to use the two libraries together.
</p>

<p>
My main blocker here was that Liberator didn't allow resources to inherit key-value pairs from other resources. The resources are effectively maps, and you should be able to define a base map of decision points and then merge them together.
</p>

<p>
So I wrote <a href="https://github.com/clojure-liberator/liberator">a pull request</a> that extends Liberator's resources to accept a <code>:base</code> key. The <code>:base</code> key takes a map of liberator decision points and creates your resource by merging the other kv pairs into these defaults.
</p>

<p>
This pull req allows you to define a base resource like this:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">base-resource</span>
  <span style="color: #8b2252;">"Base for all resources.</span>

<span style="color: #8b2252;">   Due to the way liberator's resources merge, these base definitions</span>
<span style="color: #8b2252;">   define a bunch of content types, even if the resources that inherit</span>
<span style="color: #8b2252;">   from them don't. The defaults are here to provide reasonable text</span>
<span style="color: #8b2252;">   error messages, instead of returning big slugs of html."</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">let</span> [not-found <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">comp</span> rep/ring-response
                        <span style="color: #8c8c8c;">(</span>route/not-found <span style="color: #8b2252;">"Route not found!"</span><span style="color: #8c8c8c;">))</span>
        base {<span style="color: #8b2252;">"text/html"</span> not-found}]
    {<span style="color: #008b8b;">:handle-not-acceptable</span>
     <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">-&gt;&gt;</span> {<span style="color: #8b2252;">"application/json"</span> {<span style="color: #008b8b;">:success</span> false
                               <span style="color: #008b8b;">:message</span> <span style="color: #8b2252;">"No acceptable resource available"</span>}
           <span style="color: #8b2252;">"text/plain"</span> <span style="color: #8b2252;">"No acceptable resource available."</span>}
          <span style="color: #8c8c8c;">(</span>with-default <span style="color: #8b2252;">"text/plain"</span><span style="color: #8c8c8c;">)</span>
          <span style="color: #8c8c8c;">(</span>media-typed base<span style="color: #8c8c8c;">))</span>

     <span style="color: #008b8b;">:handle-not-found</span>
     <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">-&gt;&gt;</span> {<span style="color: #8b2252;">"application/json"</span> {<span style="color: #008b8b;">:success</span> false
                               <span style="color: #008b8b;">:message</span> <span style="color: #8b2252;">"Resource not found."</span>}
           <span style="color: #8b2252;">"text/plain"</span> <span style="color: #8b2252;">"Resource not found."</span>}
          <span style="color: #8c8c8c;">(</span>with-default <span style="color: #8b2252;">"text/plain"</span><span style="color: #8c8c8c;">)</span>
          <span style="color: #8c8c8c;">(</span>media-typed base<span style="color: #8c8c8c;">))</span>}<span style="color: #8c8c8c;">))</span>
</pre>
</div>

<p>
And then write other resources that extend the base like so:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defresource</span> <span style="color: #0000ff;">hello-resource</span>
  <span style="color: #008b8b;">:base</span> base-resource
  <span style="color: #008b8b;">:allowed-methods</span> [<span style="color: #008b8b;">:get</span>]
  <span style="color: #008b8b;">:available-media-types</span> [<span style="color: #8b2252;">"text/plain"</span>]
  <span style="color: #008b8b;">:handle-ok</span> <span style="color: #8b2252;">"Welcome to the resource!"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
This tiny resource now shares the <code>:handle-not-acceptable</code> and <code>:handle-not-found</code> behavior from the base. If I hit the resource and ask for JSON, for example, I'll get a "No acceptable resource available." message in plain-text. (There's more work here to make this perfect, but hey, it's a start.)
</p>

<p>
Check out my customer version of <code>defresource</code> in the post's <a href="https://github.com/paddleguru/liberator-friend/blob/master/src/liberator_friend/resources.clj#L67">example project</a>. That namespace also contains <code>base-resource</code> and all the helper functions.
</p>
</div>
