_posts/2014-01-17-api-authentication-with-liberator-and-friend.html

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">Authenticating Resources</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
<a href="https://github.com/paddleguru/liberator-friend">liberator-friend</a> that shows off my final solution: Liberator resources that delegate to Friend into the <code>authorized?</code> point. The code is on <a href="https://github.com/paddleguru/liberator-friend">GitHub</a>.
</p>

<p>
The example project defines a <a href="https://github.com/paddleguru/liberator-friend/blob/master/src/liberator_friend/resources.clj#L218">Friend base resource</a> that provides a handler that Liberator calls when <code>:authorized?</code> returns false:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">friend-resource</span>
  <span style="color: #8b2252;">"Base resource that will handle authentication via friend's</span>
<span style="color: #8b2252;">  mechanisms. Provide an authorization function and you'll be good to</span>
<span style="color: #8b2252;">  go."</span>
  {<span style="color: #008b8b;">:base</span> base-resource
   <span style="color: #008b8b;">:handle-unauthorized</span>
   <span style="color: #8c8c8c;">(</span>media-typed {<span style="color: #8b2252;">"text/html"</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">fn</span> [req]
                               <span style="color: #8c8c8c;">(</span>unauthorized!
                                <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">-&gt;</span> req <span style="color: #008b8b;">:resource</span> <span style="color: #008b8b;">:allowed?</span><span style="color: #8c8c8c;">)</span>
                                req<span style="color: #8c8c8c;">))</span>
                 <span style="color: #8b2252;">"application/json"</span>
                 {<span style="color: #008b8b;">:success</span> false
                  <span style="color: #008b8b;">:message</span> <span style="color: #8b2252;">"Not authorized!"</span>}
                 <span style="color: #008b8b;">:default</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">constantly</span> <span style="color: #8b2252;">"Not authorized."</span><span style="color: #8c8c8c;">)</span>}<span style="color: #8c8c8c;">)</span>}<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
<code>friend-resource</code> extends <code>base-resource</code> from above, just for fun. The <code>unauthorized!</code> function above is <a href="https://github.com/paddleguru/liberator-friend/blob/master/src/liberator_friend/resources.clj#L211">also mine</a>; it pulls the <code>::friend/identity</code> key out of the request, and also sends the function representing next step in the Liberator decision tree up to Friend's middleware. (If the user's not authenticated, this lets Friend workflows perform auth with a database, then jump BACK into Liberator's decision tree at the <code>allowed?</code> stage to try again. Pretty awesome.
</p>

<p>
That covers the Friend middleware integration. Now all we need to do is override <code>:authorized?</code> on each resource to return true or false, and everything else will just work. I wrote a few helpers that make it easy to test Friend's identity map in Liberator's <code>authorized?</code> function:
</p>

<p>
This resource extends the base resource, but adds in a default unauthorized handler. This is all Friend needs - if the user's unauthorized, either handle it immediately, OR, in the HTML case (assuming browsers always access via HTML), the resource throws the proper redirect.
</p>

<p>
Now all we need to do is override <code>:authorized?</code> on each resource to return true or false, and everything else will just work.
</p>

<p>
I wrote a helper function that defines nice authorization predicates based on Friend's concept of a <code>role</code>:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">roles</span>
  <span style="color: #8b2252;">"Returns an authorization predicate that checks if the authenticated</span>
<span style="color: #8b2252;">  user has the specified roles. (This is the usual friend behavior.)"</span>
  [roles]
  <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">fn</span> [id]
    <span style="color: #8c8c8c;">(</span>friend/authorized? roles id<span style="color: #8c8c8c;">)))</span>
</pre>
</div>

<p>
This function creates a new base resource that extends <code>friend-resource</code> above, adding in the supplied authorization function:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">friend-auth</span>
  <span style="color: #8b2252;">"Returns a base resource that authenticates using the supplied</span>
<span style="color: #8b2252;">  auth-fn. Authorization failure will trigger Friend's default</span>
<span style="color: #8b2252;">  unauthorized response."</span>
  [auth-fn] {<span style="color: #008b8b;">:base</span> friend-resource
             <span style="color: #008b8b;">:authorized?</span> auth-fn}<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Those two helpers work together to create Friend-aware (Friend-ly?) base resource generators. All resources that use these bases will be protected by the Friend middleware. In the example project, this means that they'll be protected with HTTP basic authentication, but you can add more workflows to perform different auth in a way that doesn't require you to rewrite your resources.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">role-auth</span>
  <span style="color: #8b2252;">"Returns a base resource that authenticates users against the</span>
<span style="color: #8b2252;">  supplied set of roles."</span>
  [role-input]
  <span style="color: #8c8c8c;">(</span>friend-auth <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">comp</span> <span style="color: #8c8c8c;">(</span>roles role-input<span style="color: #8c8c8c;">)</span> <span style="color: #008b8b;">:request</span><span style="color: #8c8c8c;">)))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">authenticated-base</span>
  <span style="color: #8b2252;">"Returns a base resource that authenticates users against the</span>
<span style="color: #8b2252;">  supplied set of roles."</span>
  <span style="color: #8c8c8c;">(</span>friend-auth <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">comp</span> boolean friend/identity <span style="color: #008b8b;">:request</span><span style="color: #8c8c8c;">)))</span>
</pre>
</div>

<p>
The first, <code>role-auth</code>, takes a set of roles and allows access to the resource if the authenticated user has a role that's in the set.
</p>

<p>
<code>authenticated-base</code> just checks that the user is authenticated (that the <code>::friend/identity</code> key is present); no additional authorization comes into play.
</p>

<p>
The example project performs authentication using an in-memory "database":
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">users</span>
  <span style="color: #8b2252;">"dummy in-memory user database."</span>
  {<span style="color: #8b2252;">"root"</span> {<span style="color: #008b8b;">:username</span> <span style="color: #8b2252;">"root"</span>
           <span style="color: #008b8b;">:password</span> <span style="color: #8c8c8c;">(</span>creds/hash-bcrypt <span style="color: #8b2252;">"admin_password"</span><span style="color: #8c8c8c;">)</span>
           <span style="color: #008b8b;">:roles</span> #{<span style="color: #008b8b;">:admin</span>}}
   <span style="color: #8b2252;">"jane"</span> {<span style="color: #008b8b;">:username</span> <span style="color: #8b2252;">"jane"</span>
           <span style="color: #008b8b;">:password</span> <span style="color: #8c8c8c;">(</span>creds/hash-bcrypt <span style="color: #8b2252;">"user_password"</span><span style="color: #8c8c8c;">)</span>
           <span style="color: #008b8b;">:roles</span> #{<span style="color: #008b8b;">:user</span>}}}<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Now, let's define some resources that use these helpers. These resources all use Friend for authorization. They allow, respectively, admins, users and any authenticated user.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">require</span> '[liberator-friend.resources <span style="color: #008b8b;">:as</span> r <span style="color: #008b8b;">:refer</span> [defresource]]<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defresource</span> <span style="color: #0000ff;">admin-resource</span>
  <span style="color: #008b8b;">:base</span> <span style="color: #8c8c8c;">(</span>r/role-auth #{<span style="color: #008b8b;">:admin</span>}<span style="color: #8c8c8c;">)</span>
  <span style="color: #008b8b;">:allowed-methods</span> [<span style="color: #008b8b;">:get</span>]
  <span style="color: #008b8b;">:available-media-types</span> [<span style="color: #8b2252;">"text/plain"</span>]
  <span style="color: #008b8b;">:handle-ok</span> <span style="color: #8b2252;">"Welcome, admin!"</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defresource</span> <span style="color: #0000ff;">user-resource</span>
  <span style="color: #008b8b;">:base</span> <span style="color: #8c8c8c;">(</span>r/role-auth #{<span style="color: #008b8b;">:user</span>}<span style="color: #8c8c8c;">)</span>
  <span style="color: #008b8b;">:allowed-methods</span> [<span style="color: #008b8b;">:get</span>]
  <span style="color: #008b8b;">:available-media-types</span> [<span style="color: #8b2252;">"text/plain"</span>]
  <span style="color: #008b8b;">:handle-ok</span> <span style="color: #8b2252;">"Welcome, user!"</span><span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defresource</span> <span style="color: #0000ff;">authenticated-resource</span>
  <span style="color: #008b8b;">:base</span> r/authenticated-base
  <span style="color: #008b8b;">:allowed-methods</span> [<span style="color: #008b8b;">:get</span>]
  <span style="color: #008b8b;">:available-media-types</span> [<span style="color: #8b2252;">"text/plain"</span>]
  <span style="color: #008b8b;">:handle-ok</span> <span style="color: #8b2252;">"Come on in. You're authenticated."</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Now we can serve these out using Compojure:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defroutes</span> <span style="color: #0000ff;">site-routes</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">GET</span> <span style="color: #8b2252;">"/"</span> [] <span style="color: #8b2252;">"Welcome to the liberator-friend demo site!"</span><span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">GET</span> <span style="color: #8b2252;">"/admin"</span> [] admin-resource<span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">GET</span> <span style="color: #8b2252;">"/authenticated"</span> [] authenticated-resource<span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">GET</span> <span style="color: #8b2252;">"/user"</span> [] user-resource<span style="color: #8c8c8c;">))</span>
</pre>
</div>

<p>
Now let's hit the shell to test out the custom auth.
</p>
</div>
</div>
