org/_posts/2014-01-17-api-authentication-with-liberator-and-friend.org
*** Testing with CURL

You can follow along by cloning [[https://github.com/sritchie/liberator-friend][the example code]] and running =lein run= in the project's root. The default route has no authentication requirement, and returns the string defined in the compojure routes above:

#+BEGIN_SRC sh
[sritchie@RitchieMacBook ~]$ curl localhost:8090
Welcome to the liberator-friend demo site!
#+END_SRC

Now let's hit the admin resource without basic authentication.

#+BEGIN_SRC sh
[sritchie@RitchieMacBook ~]$ curl localhost:8090/admin
Not authorized.
#+END_SRC

Because we didn't include a basic auth header, Friend's =basic-auth= middleware returned let the request through without adding =::friend/identity=. The request hit the Liberator resource, the =:authorized?= check failed, and Liberator delegated to the =:handle-unauthorized= decision point defined in [[https://github.com/sritchie/liberator-friend/blob/master/src/liberator_friend/resources.clj#L218][friend-resource]]. This decision point ONLY throws the Friend exception for "text/html" requests, since I only wanted to redirect for Browser requests. Instead we get the default "Not authorized." response defined [[https://github.com/sritchie/liberator-friend/blob/master/src/liberator_friend/resources.clj#L231][here]], decked out with the proper =401 Unauthorized= response code. Thanks, Liberator.

Let's try it with bad credentials.

#+BEGIN_SRC sh
[sritchie@RitchieMacBook ~]$ curl -u root:wrongpass localhost:8090/admin
#+END_SRC

We get no text response, just a =401 Unauthorized=. Because I included basic auth credentials and an =authorization= header, The =basic-auth= workflow in Friend's middleware DID try to authenticate. When authentication against the =users= failed, rather than pass the request through to my liberator =:handle-unauthorized= hook, Friend returned its own [[https://github.com/cemerick/friend/blob/master/src/cemerick/friend/workflows.clj#L9][default response]].

I think that this is the most confusing aspect of integrating Liberator and Friend. Because Friend's workflows DO sometimes return their own responses, if you're going to throw an =unauthorized!= exception you need to prepare for this and share the proper responses between the middleware resources and your custom workflows.

Finally, with proper credentials:

#+BEGIN_SRC sh
[sritchie@RitchieMacBook ~]$ curl -u root:admin_password localhost:8090/admin
Welcome, admin!
#+END_SRC

The =basic-auth= workflow adds =::friend/identity= into the session, =:authorized?= checks for the =:admin= role and returns true, and =:handle-ok= returns "Welcome, admin!".

What if we supply valid credentials, authenticate properly with Friend, but try to access a route that we're not authorized to see?

#+BEGIN_SRC sh
[sritchie@RitchieMacBook ~]$ curl -u jane:user_password localhost:8090/user
Welcome, user!

[sritchie@RitchieMacBook ~]$ curl -u jane:user_password localhost:8090/admin
Not authorized.
#+END_SRC

Friend's =basic-auth= workflow lets both requests through, but =:authorized?= returns true in the first case, false in the second. Because Friend's middleware was happy Friend supplies no response, leaving the response to Liberator. Liberator calls =:handle-ok= in the first case and =:handle-unauthorized= in the second.

For completeness, here are the same routes with valid admin credentials:

#+BEGIN_SRC sh
[sritchie@RitchieMacBook ~]$ curl -u root:admin_password localhost:8090/admin
Welcome, admin!

[sritchie@RitchieMacBook ~]$ curl -u root:admin_password localhost:8090/user
Not authorized.
#+END_SRC

And proof that the =/authenticated= route allows any valid credentials:

#+BEGIN_SRC sh
[sritchie@RitchieMacBook ~]$ curl -u root:admin_password localhost:8090/authenticated
Come on in. You're authenticated.

[sritchie@RitchieMacBook ~]$ curl -u jane:user_password localhost:8090/authenticated
Come on in. You're authenticated.
#+END_SRC

** Conclusions

So, there you have it. Friend and Liberator, working in glorious harmony.

As confusing as I find Friend, I think it's the best solution out there for authentication and authorization for Ring applications. Communication through exception football can be pretty confusing, but it seems like the best way to handle the redirect coordination you need if you want users to be able to "pause" a route, authorize at a different route, then come back to the original URI for another try.

Both of these libraries are worth exploring, and together they sing. After the initial learning curve, the combination has made it easy to iterate on RESTful APIs in Clojure here at [[https://paddleguru.com][PaddleGuru]].
