_posts/2014-01-17-api-authentication-with-liberator-and-friend.html
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">Testing with CURL</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
You can follow along by cloning <a href="https://github.com/paddleguru/liberator-friend">the example code</a> and running <code>lein run</code> in the project's root. The default route has no authentication requirement, and returns the string defined in the compojure routes above:
</p>

<div class="org-src-container">

<pre class="src src-sh">[sritchie@RitchieMacBook ~]$ curl localhost:8090
Welcome to the liberator-friend demo site!
</pre>
</div>

<p>
Now let's hit the admin resource without basic authentication.
</p>

<div class="org-src-container">

<pre class="src src-sh">[sritchie@RitchieMacBook ~]$ curl localhost:8090/admin
Not authorized.
</pre>
</div>

<p>
Because we didn't include a basic auth header, Friend's <code>basic-auth</code> middleware returned let the request through without adding <code>::friend/identity</code>. The request hit the Liberator resource, the <code>:authorized?</code> check failed, and Liberator delegated to the <code>:handle-unauthorized</code> decision point defined in <a href="https://github.com/paddleguru/liberator-friend/blob/master/src/liberator_friend/resources.clj#L218">friend-resource</a>. This decision point ONLY throws the Friend exception for "text/html" requests, since I only wanted to redirect for Browser requests. Instead we get the default "Not authorized." response defined <a href="https://github.com/paddleguru/liberator-friend/blob/master/src/liberator_friend/resources.clj#L231">here</a>, decked out with the proper <code>401 Unauthorized</code> response code. Thanks, Liberator.
</p>

<p>
Let's try it with bad credentials.
</p>

<div class="org-src-container">

<pre class="src src-sh">[sritchie@RitchieMacBook ~]$ curl -u root:wrongpass localhost:8090/admin
</pre>
</div>

<p>
We get no text response, just a <code>401 Unauthorized</code>. Because I included basic auth credentials and an <code>authorization</code> header, The <code>basic-auth</code> workflow in Friend's middleware DID try to authenticate. When authentication against the <code>users</code> failed, rather than pass the request through to my liberator <code>:handle-unauthorized</code> hook, Friend returned its own <a href="https://github.com/cemerick/friend/blob/master/src/cemerick/friend/workflows.clj#L9">default response</a>.
</p>

<p>
I think that this is the most confusing aspect of integrating Liberator and Friend. Because Friend's workflows DO sometimes return their own responses, if you're going to throw an <code>unauthorized!</code> exception you need to prepare for this and share the proper responses between the middleware resources and your custom workflows.
</p>

<p>
Finally, with proper credentials:
</p>

<div class="org-src-container">

<pre class="src src-sh">[sritchie@RitchieMacBook ~]$ curl -u root:admin_password localhost:8090/admin
Welcome, admin!
</pre>
</div>

<p>
The <code>basic-auth</code> workflow adds <code>::friend/identity</code> into the session, <code>:authorized?</code> checks for the <code>:admin</code> role and returns true, and <code>:handle-ok</code> returns "Welcome, admin!".
</p>

<p>
What if we supply valid credentials, authenticate properly with Friend, but try to access a route that we're not authorized to see?
</p>

<div class="org-src-container">

<pre class="src src-sh">[sritchie@RitchieMacBook ~]$ curl -u jane:user_password localhost:8090/user
Welcome, user!

[sritchie@RitchieMacBook ~]$ curl -u jane:user_password localhost:8090/admin
Not authorized.
</pre>
</div>

<p>
Friend's <code>basic-auth</code> workflow lets both requests through, but <code>:authorized?</code> returns true in the first case, false in the second. Because Friend's middleware was happy Friend supplies no response, leaving the response to Liberator. Liberator calls <code>:handle-ok</code> in the first case and <code>:handle-unauthorized</code> in the second.
</p>

<p>
For completeness, here are the same routes with valid admin credentials:
</p>

<div class="org-src-container">

<pre class="src src-sh">[sritchie@RitchieMacBook ~]$ curl -u root:admin_password localhost:8090/admin
Welcome, admin!

[sritchie@RitchieMacBook ~]$ curl -u root:admin_password localhost:8090/user
Not authorized.
</pre>
</div>

<p>
And proof that the <code>/authenticated</code> route allows any valid credentials:
</p>

<div class="org-src-container">

<pre class="src src-sh">[sritchie@RitchieMacBook ~]$ curl -u root:admin_password localhost:8090/authenticated
Come on in. You<span style="color: #8b2252;">'re authenticated.</span>

<span style="color: #8b2252;">[sritchie@RitchieMacBook ~]$ curl -u jane:user_password localhost:8090/authenticated</span>
<span style="color: #8b2252;">Come on in. You'</span>re authenticated.
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Conclusions</h3>
<div class="outline-text-3" id="text-1-4">
<p>
So, there you have it. Friend and Liberator, working in glorious harmony.
</p>

<p>
As confusing as I find Friend, I think it's the best solution out there for authentication and authorization for Ring applications. Communication through exception football can be pretty confusing, but it seems like the best way to handle the redirect coordination you need if you want users to be able to "pause" a route, authorize at a different route, then come back to the original URI for another try.
</p>

<p>
Both of these libraries are worth exploring, and together they sing. After the initial learning curve, the combination has made it easy to iterate on RESTful APIs in Clojure here at <a href="https://paddleguru.com">PaddleGuru</a>.
</p>
</div>
</div>
</div>
